package com.gourd.erwa.util.corejava.basis;

/**
 * 语法基础
 * 如何将字符串转换为数字？
 * 如何将数字转换为十六进制字符串？
 * 如何将字节串转换为十六进制字符串？
 * 如何对浮点数打印出指定小数位数？
 * 如何将浮点数输出为指定位数的科学计数法？
 * 如何将数字输出为每三位逗号分隔的格式，例如“1,234,467”？
 * 如何将字符串转换为Boolean对象？
 * 如何将一个四字节转换为一个整数？以及反过来？
 * <p>
 * 日期操作
 * 如何获取当前的月份？
 * 如何获取指定日期所在的周从哪一天开始？
 * 如何知道现在距离指定的时间还有多久？
 * 如何知道两个时间段是否有重合的部分？
 * <p>
 * 正则表达式
 * 如何将字符串按指定的字符进行分割？
 * 如何用正则表达式搜索字符串并提取找到的内容？
 * 如何用正则表达式将时间字符串从"yyyyMMdd"转换为"yyyy-MM-dd"？
 * <p>
 * 数组操作
 * 如何创建空数组？
 * 如何对数组进行排序？
 * 如何提取数组的一部分生成另一个数组？
 * 如何合并两个数组，同时使合并的数组中不包含重复的元素？
 * 如何在数组中用二分法搜索元素？
 * 如何将数组反转？
 * <p>
 * 集合操作
 * 如何将数组转换为List？
 * 如何将List转换为数组？
 * <p>
 * 如何将元素插入List的指定位置？
 * 如何将List反转？
 * 如何将List乱序？
 * 如何删除List中符合指定条件的元素？
 * 如何复制List？
 * 如何清空List？
 * 如何创建空List？
 * List和Vector有什么不同？
 * 如何合并两个List？
 * <p>
 * Map中的一个key能否对应两个不同的value？
 * Map中的一个value能否对应两个不同的key？
 * 如何从Map中删除符合指定条件的value？
 * 如何使遍历Map时取出的元素顺序与放入时一致？
 * 如何合并两个Map？
 * <p>
 * 如何使用Queue？
 * 如何使用Stack？
 * <p>
 * 文件系统
 * 如何创建一个文件夹？
 * 如何列出目录下的文件？
 * 如何遍历一个目录及其子目录下的所有文件？
 * <p>
 * 如何创建一个文件？
 * 如何获取文件的长度？
 * 如何判断指定的文件是否存在？
 * 如何按照指定的编码向文件中写入文本？
 * 如何在文件末尾追加文本？
 * 如何按行读取文本文件的内容？
 * <p>
 * 网络编程
 * 如何使用Socket和ServerSocket？
 * 如何通过Socket发送和接收文件？
 * <p>
 * 如何使用URLConnection下载一个文件？
 * <p>
 * 资源文件
 * 如何用 Properties 类读取 .properties 文件？
 * 如何用 ResourceBundle 类读取 .properties 文件？
 * 如何用 ResourceBundle 实现程序界面的多语言支持？
 * <p>
 * 多线程
 * 如何创建并运行一个线程？
 * 如何创建和使用Java自带的线程池？
 * 如何定时运行一个任务？
 *
 * @author wei.Li by 14-8-25.
 */
public class SomeBasisIssue {

}
